package com.example.javacoretrainingpart1.classes.task7;

/*
      VII

      Задача на взаимодействие между классами. Разработать систему «Интернет-магазин».
      Товаровед добавляет информацию о Товаре. Клиент делает и оплачивает Заказ на Товары.
      Товаровед регистрирует Продажу и может занести неплательщика в «черный список».
*/

/*
        Товаровед - Expert
        Товар - Product
        Клиент - Client
        Заказ - Order
        Продажа - Sale
*/

public class OnlineStoreSystem {

}
